using System;
using System.IO;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;
using System.Security;
using System.Text.Unicode;
using System.Threading;

namespace ConsoleApp1.ClrTracer
{
	public unsafe sealed class UnmanagedLibrary
	{
		private readonly void* _code;

		public enum Status
		{
			Ok,
			FailedToAllocateMemory,
			InvalidDosSignature,
			InvalidNtSignature,
			NotSupportedImageType,
			MachineTypeMismatch,
			InvalidSectionAlignment,
			InvalidImportTable,
			FailedToLoadLibrary,
			FailedToGetFunctionAddress,
			FailedToApplySectionAttributes
		}

		[UnmanagedFunctionPointer(CallingConvention.StdCall)]
		[SuppressUnmanagedCodeSecurity]
		private delegate int DllMainD(IntPtr hModule, int reason, IntPtr lpReserved);
		[UnmanagedFunctionPointer(CallingConvention.StdCall)]
		[SuppressUnmanagedCodeSecurity]
		private delegate IntPtr LoadLibraryWD(IntPtr p);
		[UnmanagedFunctionPointer(CallingConvention.StdCall)]
		[SuppressUnmanagedCodeSecurity]
		private delegate IntPtr LoadLibraryAD(IntPtr p);
		[UnmanagedFunctionPointer(CallingConvention.StdCall)]
		[SuppressUnmanagedCodeSecurity]
		private delegate IntPtr VirtualAllocD(IntPtr p, ulong p1, AllocationType p2, MemoryProtection p3);
		[UnmanagedFunctionPointer(CallingConvention.StdCall)]
		[SuppressUnmanagedCodeSecurity]
		private delegate bool VirtualFreeD(IntPtr p, ulong p1, AllocationType p2);
		[UnmanagedFunctionPointer(CallingConvention.StdCall)]
		[SuppressUnmanagedCodeSecurity]

			tmp[^3] = (byte)'d';
			tmp[^2] = (byte)'l';
			tmp[^1] = (byte)'l';
			var forwardedModule = LoadLibraryA((IntPtr) Unsafe.AsPointer(ref tmp[0]));
			if (forwardedModule != IntPtr.Zero)
			{
				address = GetProcAddress((void*)forwardedModule, (byte*)address + splitAt + 1, dllNameLength);
			}

			return address;
		}

		[MethodImpl(MethodImplOptions.AggressiveInlining)]
		private static int GetAnsiString(byte* pointer)
		{
			var start = pointer;
			while (*pointer++ != 0)
			{
			}
			return (int)(pointer - start - 1);
		}

        [MethodImpl(MethodImplOptions.AggressiveInlining)]
		private static ulong ImageOrdianl32(uint ordianl) => ordianl & 0xffff;

		[MethodImpl(MethodImplOptions.AggressiveInlining)]
		private static ulong ImageOrdianl64(ulong ordianl) => ordianl & 0xffff;

		[MethodImpl(MethodImplOptions.AggressiveInlining)]
		private static bool ImageSnapByOrdinal32(uint ordinal) => (ordinal & 0x80000000) != 0;

		[MethodImpl(MethodImplOptions.AggressiveInlining)]
		private static bool ImageSnapByOrdinal64(ulong ordinal) => (ordinal & 0x8000000000000000UL) != 0;

		[MethodImpl(MethodImplOptions.AggressiveInlining)]
		private static ulong AlignValueUp(ulong value, ulong alignment) => (value + alignment - 1) & ~(alignment - 1);

		[MethodImpl(MethodImplOptions.AggressiveInlining)]
		private static ulong AlignValueDown(ulong value, ulong alignment) => value & ~(alignment - 1);

		[MethodImpl(MethodImplOptions.AggressiveInlining)]
		private static void* AlignAddressDown(void* address, ulong alignment) => (void*) AlignValueDown((ulong) address, alignment);

		[MethodImpl(MethodImplOptions.AggressiveInlining)]
		private static long GetStreamOffsetOfFirstSection(Stream src, ImageNtHeaders* ntHeaders)
		{
			src.Position = 0;
			return src.Read<ImageDosHeader>().LfaNew + ((byte*)&ntHeaders->OptionalHeader - (byte*)ntHeaders) + ntHeaders->FileHeader.SizeOfOptionalHeader;
			// return src.Read<ImageDosHeader>().LfaNew + (int)(UnsafePointer<ImageOptionalHeader>.Of(UnsafePointer<ImageNtHeaders>.Of(ntHeaders).Value.OptionalHeader).ReinterpretAs<byte>() - UnsafePointer<ImageNtHeaders>.Of(ntHeaders).ReinterpretAs<byte>() + ntHeaders.FileHeader.SizeOfOptionalHeader);
		}

		[MethodImpl(MethodImplOptions.AggressiveInlining)]
		private static ImageSectionHeader* GetFirstSectionPointer(ImageNtHeaders* ntHeaders)
		{
			return (ImageSectionHeader*) ((byte*) ntHeaders + ((byte*) &ntHeaders->OptionalHeader - (byte*) ntHeaders + ntHeaders->FileHeader.SizeOfOptionalHeader));

			// return ((byte*)ntHeaders + (int)(UnsafePointer<ImageOptionalHeader>.Of(UnsafePointer<ImageNtHeaders>.Of(ntHeaders.Value).Value.OptionalHeader).ReinterpretAs<byte>() - UnsafePointer<ImageNtHeaders>.Of(ntHeaders.Value).ReinterpretAs<byte>() + ntHeaders.Value.FileHeader.SizeOfOptionalHeader)).ReinterpretAs<ImageSectionHeader>();
		}

		[StructLayout(LayoutKind.Explicit, Size = 0x40)]
		private readonly struct ImageDosHeader
		{
			[FieldOffset(0x00)]
			public readonly ushort Magic;
			[FieldOffset(0x3c)]
			public readonly int LfaNew;
		}

		[StructLayout(LayoutKind.Explicit)]
		private struct ImageNtHeaders
		{
			[FieldOffset(0x00)]
			public readonly uint Signature;
			[FieldOffset(0x04)]
			public readonly ImageFileHeader FileHeader;
			[FieldOffset(0x18)]
			public ImageOptionalHeader OptionalHeader;
		}

		[StructLayout(LayoutKind.Explicit, Size = 0x14)]
		private readonly struct ImageFileHeader
		{
			[FieldOffset(0x00)]
			public readonly MachineType Machine;
			[FieldOffset(0x02)]
			public readonly ushort NumberOfSections;
			[FieldOffset(0x10)]
			public readonly ushort SizeOfOptionalHeader;
			[FieldOffset(0x12)]
			public readonly ushort Characteristics;
		}

		[StructLayout(LayoutKind.Explicit)]
		private struct ImageOptionalHeader
		{
			[FieldOffset(0x08)]
			public readonly uint SizeOfInitializedData;
			[FieldOffset(0x0c)]
			public readonly uint SizeOfUninitializedData;
			[FieldOffset(0x10)]
			public readonly uint AddressOfEntryPoint;
			[FieldOffset(0x1c)]
			public uint ImageBase32;
			[FieldOffset(0x18)]
			public ulong ImageBase64;
			[FieldOffset(0x20)]
			public readonly uint SectionAlignment;
			[FieldOffset(0x38)]
			public readonly uint SizeOfImage;
			[FieldOffset(0x3c)]
			public readonly uint SizeOfHeaders;
			[FieldOffset(0x60)]
			public readonly ImageDataDirectory ExportTable32;
			[FieldOffset(0x70)]
			public readonly ImageDataDirectory ExportTable64;
			[FieldOffset(0x68)]
			public readonly ImageDataDirectory ImportTable32;
			[FieldOffset(0x78)]
			public readonly ImageDataDirectory ImportTable64;
			[FieldOffset(0xa0)]
			public readonly ImageDataDirectory BaseRelocationTable32;
			[FieldOffset(0xb0)]
			public readonly ImageDataDirectory BaseRelocationTable64;
			[FieldOffset(0xd8)]
			public readonly ImageDataDirectory TLSTable32;
			[FieldOffset(0xe8)]
			public readonly ImageDataDirectory TLSTable64;
		}

		[StructLayout(LayoutKind.Explicit, Size = 0x08)]
		private readonly struct ImageDataDirectory
		{
			[FieldOffset(0x00)]
			public readonly uint VirtualAddress;
			[FieldOffset(0x04)]
			public readonly uint Size;
		}

		[StructLayout(LayoutKind.Explicit, Size = 0x28)]
		private struct ImageSectionHeader
		{
			[FieldOffset(0x08)]
			public uint PhysicalAddress;
			[FieldOffset(0x0c)]
			public readonly uint VirtualAddress;
			[FieldOffset(0x10)]
			public readonly uint SizeOfRawData;
			[FieldOffset(0x14)]
			public readonly uint PointerToRawData;
			[FieldOffset(0x24)]
			public readonly uint Characteristics;
		}

		[StructLayout(LayoutKind.Explicit)]
		private readonly struct ImageImportDescriptor
		{
			[FieldOffset(0x00)]
			public readonly uint OriginalFirstThunk;
			[FieldOffset(0x0c)]
			public readonly uint Name;
			[FieldOffset(0x10)]
			public readonly uint FirstThunk;
		}

		[StructLayout(LayoutKind.Explicit)]
		private struct ImageImportByName
		{
			[FieldOffset(0x02)]
			public fixed byte Name[1];
		}

		[StructLayout(LayoutKind.Explicit)]
		private readonly struct ImageExportDirectory
		{
			[FieldOffset(0x10)]
			public readonly uint Base;
			[FieldOffset(0x14)]
			public readonly uint NumberOfFunctions;
			[FieldOffset(0x18)]
			public readonly uint NumberOfNames;
			[FieldOffset(0x1c)]
			public readonly uint AddressOfFunctions;
			[FieldOffset(0x20)]
			public readonly uint AddressOfNames;
			[FieldOffset(0x24)]
			public readonly uint AddressOfNameOrdinals;
		}

		[StructLayout(LayoutKind.Sequential)]
		private readonly struct ImageBaseRelocation
		{
			public readonly uint VirtualAdress;
			public readonly uint SizeOfBlock;
		}

		[StructLayout(LayoutKind.Explicit)]
		private readonly struct ImageTlsDirectory
		{
			[FieldOffset(0x0c)]
			public readonly ulong AddressOfCallBacks32;
			[FieldOffset(0x18)]
			public readonly ulong AddressOfCallBacks64;
		}

		private static class Signatures
		{
			public const ushort Dos = 0x5A4D;
			public const uint Nt = 0x00004550;
		}

		private enum MachineType : ushort
		{
			I386 = 0x014c,
			Amd64 = 0x8664
		}

		private enum BasedRelocationType
		{
			Absolute = 0,
			HighLow = 3,
			Dir64 = 10
		}

		private const uint InitializedData = 0x00000040;
		private const uint UninitializedData = 0x00000080;
		private const uint Discardable = 0x02000000;
		private const uint NotCached = 0x04000000;

		private enum ImageSectionFlags : uint
		{
			Execute = 0x20000000,
			Read = 0x40000000,
			Write = 0x80000000
		}

		private struct SectionFinalizeData
		{
			public void* Address;
			public void* AlignedAddress;
			public ulong Size;
			public uint Characteristics;
			public bool Last;
		}

		[Flags]
		private enum AllocationType : uint
		{
			Commit = 0x1000,
			Reserve = 0x2000,
			Decommit = 0x4000,
			Release = 0x8000
		}

